app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."first_name" = ? LIMIT ?  [["first_name", "Kimberly"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE (user_id = 1 )
---
  def Profile
  	if (User.find_by_first_name(params[:id]))
  		@first_name = params[:id]
  	else
  		redirect_to root_path, :notice => "user not found"
  	end

  	@pets = Pet.all.where("user_id = ? ", User.find_by_first_name(params[:id]).id)

SELECT  "offices".* FROM "offices" WHERE "offices"."business_name" = ? LIMIT ?  [["business_name", "1"], ["LIMIT", 1]]
---
  def Office
    if (Office.find_by_business_name(params[:id]))